---
kind: method
id: M:Autodesk.Revit.DB.WorksharingTooltipInfo.Dispose
source: html/a0361ae6-d166-8707-05a4-94355966a7a0.htm
---
# Autodesk.Revit.DB.WorksharingTooltipInfo.Dispose Method

Releases all resources used by the WorksharingTooltipInfo

## Syntax (C#)
```csharp
public void Dispose()
```